namespace GamePlanetarium.Domain.Game;

public class QuestionsSeedUkr : QuestionsSeed
{
    public override QuestionTextData[] QuestionsText { get; } =
    {
        new QuestionTextData(
            "Чи можна побачити своє зодіакальне сузір’я на зоряному небі у свій день народження?", new[]
            {
                "Так",
                "Ні, бо в цей час Сонце перебуватиме у цьому сузір’ї  й заважатиме його бачити удень",
                "Немає значення, упродовж доби на небі з’являються всі дванадцять зодіакальних сузір’їв"
            }),
        new QuestionTextData(
            "Навіщо потрібне золоте напилення на шоломі скафандра?", new[]
            {
                "Щоб захистити очі астронавта від сліпучого сонячного світла",
                "Щоб відбивати астронавта-напарника, коли той робитиме світлини, " +
                "аби він не залишився без космічних фото на згадку",
                "Щоб бути стильним"
            }),
        new QuestionTextData(
            "Чому ми бачимо Місяць у різних кольорах?", new[]
            {
                "Тому що його освітлюють різними лампами", 
                "Колір залежить від температури поверхні Місяця",
                "Наша атмосфера слугує оптичним фільтром, тож колір залежить від того, " +
                "як проміння Сонця проходять крізь неї"
            }),
        new QuestionTextData(
            "Дивлячись на зоряне небо, ми дивимося у минуле. " +
            "Як далеко у минуле зазирають сучасні телескопи?", new[]
            {
                "У часи утворення перших зірок (13,5 мільярдів років тому)", 
                "У часи формування галактики Чумацький Шлях (13 мільярдів років тому)",
                "У час утворення Сонячної системи (4,6 мільярдів років тому)"
            }),
        new QuestionTextData(
            "Чому Меркурій має більшу орбітальну швидкість, ніж Нептун?", new[]
            {
                "Меркурій активніший за Нептун",
                "Нептун масивніший за Меркурій, тому йому дуже важко рухатися",
                "Через дію гравітації Сонця"
            }),
        new QuestionTextData(
            "Як таргани опинилися у космосі?", new[]
            {
                "Вони там завжди були",
                "Жодна істота не потрапляє у космос випадково, адже все проходить так звану \"чисту кімнату\". " +
                "Тарганів відправили в космос навмисне",
                "Таргани написали петицію про жорстоке ставлення до них"
            }),
        new QuestionTextData(
            "Де у галактиці Чумацький Шлях знаходиться Сонячна Система?", new[]
            {
                "В центрі",
                "На околиці",
                "В рукаві Оріона"
            }),
        new QuestionTextData(
            "Який штучний супутник на орбіті Землі найбільший?", new[]
            {
                "Міжнародна космічна станція",
                "Океан-1",
                "Tesla"
            }),
        new QuestionTextData(
            "На якій ракеті у космос полетіла перша собака Лайка?", new[]
            {
                "Не на дуже надійній",
                "Супутник-2",
                "На шатлі «Колумбія»"
            }),
        new QuestionTextData(
            "Що з цього не є назвою туманності?", new[]
            {
                "Тухле яйце",
                "Привид Сатурна",
                "Філософський Камінь"
            }),
        new QuestionTextData(
            "Чорні діри живуть вічно?", new[]
            {
                "Так! адже вони постійно поглинають все навкруги",
                "Чорних дір не існує – це казка від вчених",
                "Після відкриття випромінювання Хокінга вчені вважають, що з часом чорні діри \"випаровуються\""
            }),
        new QuestionTextData(
            "На Вашу думку, який захід проводився у Планетарії?", new[]
            {
                "Гендер-паті (визначення статі дитини)",
                "Освідчення під зорями",
                "День народження"
            }),
        new QuestionTextData(
            "Як науковці змогли дізнатися об’єм Сонця, масу чорних дір та кількість зірок у галактиці?", new[]
            {
                "Це кропітка спільна праця астрономів, математиків та фізиків",
                "Були успішні експедиції направлені на вивчення та дослідження кожного об’єкту Всесвіту",
                "Просто вчені усе вигадали, аби їм не ставили зайвих питань"
            }),
        new QuestionTextData(
            "Як можна зробити подорож Всесвітом у Планетарії приємнішою?", new[]
            {
                "Одягти скафандр",
                "Взяти з собою ароматну каву",
                "Ні, все ж таки, скафандр"
            }),
        new QuestionTextData(
            "Скільки ламп необхідно цьому проєктору для роботи?", new[]
            {
                "Однієї свічки буде вдосталь",
                "Одна лампа",
                "4500 ламп"
            }),
    };
}